Revit 2027 API
FabricationHostedInfo.DisconnectFromHost Method
 Disconnects the part from the host.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void DisconnectFromHost()
Public Sub DisconnectFromHost
public:
void DisconnectFromHost()
member DisconnectFromHost : unit -> unit
See Also
Reference
FabricationHostedInfo Class
Autodesk.Revit.DB Namespace